{
  "name": "AUSTRIACARD HOLDINGS AG",
  "symbol": "ACAG",
  "logo": "https://www.wienerborse.at/uploads/logos/7952.gif",
  "description": "With 125 years of history in the field, AUSTRIACARD HOLDINGS is one of the leading B2B (business-to-business) providers of secure data and payment solutions in Europe being a market leader in Austria, Scandinavia, Central and Eastern Europe and South Eastern Europe, with significant market shares in many other European countries and Türkiye having a strong growth performance. Additionally, the Group has high future potential outside Europe, especially in the US market after the establishment of its new personalization centre, and in the Middle East & Africa region having established local presence and resources. AUSTRIACARD HOLDINGS is also a partner of choice in the provision of payment products and solutions to the Challenger Banks/Neo Banks, hence addressing a growing market segment with significant potential on world-wide scale. The Group has a very strong pan-European operational footprint, reaching from the United Kingdom to Greece and Türkiye, with seven production facilities and seven personalization centres in Europe, as well as an additional personalization centre in USA. This footprint provides to us the ability to serve our customers, in the best possible way having a high service level. Its reliability is confirmed by the confidence of its customers across 50 countries in highly sensitive areas of Financial Institutions, Government & Public Sector, Telecommunications, Transportation as well as Industry & Retail. The Group’s international customer base benefits from a complementary product and service offering ranging from bill printing, direct mailing and document processing to payment, transit and ID cards increasingly bundled with online, mobile and digitalization transformation solutions.",
  "firstDay": null,
  "nace": "",
  "sectorId": "",
  "sectorName": null,
  "quantity": null,
  "url": null,
  "id": "AT0000A325L0"
}