{
  "name": "AMAG Austria Metall AG",
  "symbol": "AMAG",
  "logo": "https://www.wienerborse.at/uploads/logos/8916.gif",
  "description": "AMAG is an integrated producer of aluminium products which is headquartered in Ranshofen, Austria. This plant produces high-quality recycling cast and rolled products. AMAG owns a 20% interest in the Alouette smelter, which is located in Sept-Îles, Canada, and produces primary aluminium. AMAG components based in Übersee am Chiemsee, Germany, is a 100% subsidiary of AMAG and an established manufacturer of ready-to-install metal parts for the aerospace industry. The operative business is carried out in the metal, casting and rolling segments. The Metal Division includes the AMAG Group's 20% interest in the Aluminerie Alouette smelter and is responsible for the risk management and steering of metal flows within the AMAG Group. Located in Canada, the Alouette aluminium smelter is highly efficient, and benefits from a secure long-term energy supply in a politically stable country. The AMAG Group's Casting Division recycles aluminium scrap to produce high-quality foundry alloys. Its product portfolio covers aluminium materials tailored to customer requirements in the form of ingots, sows and liquid aluminium. The Division's core competences comprise the development of alloys in cooperation with customers, and the procurement and processing of aluminium scrap at the Ranshofen site. The AMAG Group's Rolling Division is responsible for the production and sale of rolled products (sheets, coils and plates), and precision cast and rolled plates. The rolling mill specialises in premium products for selected markets. The mill is supplied by our rolling slab casthouse with rolling slabs predominantly manufactured by utilising a very high share of aluminium scrap. AMAG components, a production company for the aerospace industry, is integrated in the Rolling Division. The core competence lies in the mechanical processing of aluminum and titanium. The production of ready-for-installation metal structural components takes place in Übersee am Chiemsee and in Karlsruhe (Germany).",
  "firstDay": null,
  "nace": "",
  "sectorId": "",
  "sectorName": null,
  "quantity": null,
  "url": null,
  "id": "AT00000AMAG3"
}