{
  "name": "EVN AG",
  "symbol": "EVN",
  "logo": "https://www.wienerborse.at/uploads/logos/8146.gif",
  "description": "EVN is a leading, international and publicly listed energy and environmental services company, with headquarters in Lower Austria, the country’s largest federal province. Based on state-of-the-art infrastructure, EVN provides its home market with electricity, natural gas, heat, drinking water and wastewater treatment, waste incineration and related services from a single supplier. Furthermore, the company operates cable TV and telecommunications networks and offers various energy services for private and business customers as well as municipalities as part of its portfolio. The energy business abroad includes retailing both electricity and natural gas in Germany, electricity in Bulgaria, Macedonia, and natural gas in Croatia. Additionally energy business includes electricity production in Macedonia. Further business activities EVN pursues are the production and retail of heat in Bulgaria, the procurement of electricity, natural gas and other primary energy sources, and the trade of electricity and gas on wholesale markets. Based on the acquisition of a German environmental services group in 2003, EVN significantly expanded its product portfolio and geographical outreach. It managed to build up and integrate a second strategic pillar of its business operations, the Environmental Services segment. EVN boasts extensive expertise in the planning and construction of drinking water supply, wastewater treatment, desalination and waste incineration plants with the experience of 100 environmental projects carried out in its markets. On the basis of exploiting synergies among the different business areas of EVN in Austria and abroad, the focus of all business activities is the sustainable creation and increase of value for the benefit of customers, shareholders and employees. The main principles underlying EVN's business operations are ensuring the security and reliability of energy supplies, responsibly using natural resources, creating a modern and environmentally compatible infrastructure, and the consistent positioning of EVN as a provider of top quality services. The province of Lower Austria is the majority shareholder of EVN, with a stake of around 51%. Since 1990, 49 percent of EVN has been privatized and the Company has been listed on the Vienna Stock Exchange.",
  "firstDay": null,
  "nace": "",
  "sectorId": "",
  "sectorName": null,
  "quantity": null,
  "url": null,
  "id": "AT0000741053"
}